// Написать программу, которая  выводит на экран:
//         “Hello, World!”
//         \\Dennis Ritchi\\
// Программа должна использовать поясняющие однострочные комментарии.
#include <iostream>

using namespace std;

int main() {
    cout << "\t" << '"Hello, World!"' << endl; // \t - отступ, '' - одинарные кавычки необходимы для удобного выведения двойных кавычек без экранировния
    cout << "\t\\\\Dennis Ritchi\\\\" << endl; // каждый спецсимвол \ -должен быть экранирован

    return 0;
}