// В двумерном массиве целых чисел посчитать сумму элементов:
// в каждой строке; в каждом столбце; одновременно по всем строкам и всем столбцам.
// Оформить следующим образом:
    
//     3   5    6    7  |  21
//    12   1    1    1  |  15
//     0   7   12    1  |  20
//     ---------------------
//    15  13   19    9  |  56

#include <iostream>

using namespace std;

int main() {
    setlocale(LC_ALL, "rus");
    int set[3][4] = {
        { 3, 5, 6, 7 },
        { 12, 1, 1, 1 },
        { 0, 7, 12, 1 }
    };

    cout << "Задание 3: \r\n";
    cout << "\t В двумерном массиве целых чисел посчитать сумму элементов: \r\n";
    cout << "\t в каждой строке; в каждом столбце; одновременно по всем строкам и всем столбцам. \r\n";
    cout << "\t Оформить следующим образом: \r\n";
    cout << "\t  3   5    6    7  |  21 \r\n";
    cout << "\t 12   1    1    1  |  15 \r\n";
    cout << "\t  0   7   12    1  |  20 \r\n";
    cout << "\t  ---------------------  \r\n";
    cout << "\t  15  13   19   9  |  56 \r\n";

    int column[4] = { 0, 0 ,0 ,0 };
    for (int i = 0; i < 3; i++) {
        int line = 0;
        
        for (int j = 0; j < 4; j++ ) {
            column[j] =  column[j] + set[i][j];
            cout << set[i][j] << " ";
            line =  line + set[i][j];
        }

        cout << "| " << line << endl;
    }

    cout << "---------------------" << endl;
    cout << column[0] << " " << column[1] << " " << column[2] << " " << column[3] << " | " <<  (
        column[0] + column[1] + column[2] + column[3]
    ) << endl;

    // int len = sizeof(set) / sizeof(int);

    return 0;
}